app/Http/Controllers/TuserController.php

select * from `t_users` where `user_id` = 'd1hs999' and `valid_flag` = 1 limit 1
insert into `t_login` (`login_flag`, `login_datetime`, `login_user_id`, `login_location`) values (1, '2020-07-07 03:41:42', 'd1hs99999', '緯度：33.311948799999996,経度：130.3773184')
select * from `t_staff` where `staff_code` = '99999' limit 1
---
    public function login(loginFormRequest $request) {

        $user_record = Tuser::where('user_id', $request->user_id)->where('valid_flag', 1)->first();
        // ユーザーアカウントの有効・無効
        if ( empty($user_record) ) {
                return redirect()->back()->with('flash_message', 'ユーザー名、またはパスワードが間違っています。');
        }

        if( $request->login_password == $user_record->login_password ){
            // 認証失敗許諾回数をリセット　 　最初に取得した初期値で上書き更新
            if( $user_record->allow_login_counts != 5 ){

                Tuser::where('user_id', $user_id)->where('valid_flag', 1)->update(['allow_login_counts' => 5]);

            }
            // ログインの記録
            $login_info = new Tlogin();
            $login_info->login_flag = 1;
            $login_info->login_datetime = Carbon::now();
            $login_info->login_user_id = $user_record->user_id;
            $login_info->login_location = $request->location;
            $login_info->save();

            // スタッフマスタのチェック
            // ユーザーID（t_users/assignd_staff_code）からスタッフ有無チェック（t_staff/staff_code）
            $staff = Tstaff::where('staff_code', $user_record->assigned_staff_code)->first();

select * from `t_branch` where `branch_code` = 50 limit 1
---
                return redirect()->back()->with('flash_message', 'スタッフの登録がない、または無効になっています。');
            }
            // 営業所コード（t_staff/branch_code）から営業所マスタを検索し、営業所名をセット（t_branch/branch_name）
            $branch = Tbranch::where('branch_code', $staff->branch_code)->first();

update `t_login` set `login_flag` = 2 where `login_user_id` = 'd1hs99999'
---
                Tuser::where('user_id', $user_record->user_id)->where('valid_flag', 1)->update(['valid_flag' => 0]);
                return redirect()->back()->with('flash_message', 'アカウントがロックされました。管理者に確認してください。');
            } else {
                Tuser::where('user_id', $user_record->user_id)->where('valid_flag', 1)->decrement('allow_login_counts');

select * from `t_users` where `user_id` = 'd1hs99999' and `valid_flag` = 1 limit 1
select * from `t_staff` where `staff_code` = '99999' limit 1
select * from `t_branch` where `branch_code` = 50 limit 1
---
    public function topPage(Request $request)
    {
        $user_record = Tuser::where('user_id', $request->session()->get('user_id'))->where('valid_flag', 1)->first();
        $staff = Tstaff::where('staff_code', $user_record->assigned_staff_code)->first();
        $branch = Tbranch::where('branch_code', $staff->branch_code)->first();

select * from `t_users` where `user_id` = 'd1hs99999' and `valid_flag` = 1 limit 1
select * from `t_staff` where `staff_code` = '99999' limit 1
---
    public function updateContent(Request $request)
    {
        $user_record = Tuser::where('user_id', $request->session()->get('user_id'))->where('valid_flag', 1)->first();
        $staff = Tstaff::where('staff_code', $user_record->assigned_staff_code)->first();

update `t_login` set `login_flag` = 2 where `login_user_id` = 'd1hs13876'
---
    public function logout(Request $request)
    {

        $user_id = $request->session()->pull('user_id');
        $login = Tlogin::where('login_user_id', $user_id)->update(['login_flag' => 2]);