app/Http/Controllers/TuserController.php

    public function login(loginFormRequest $request) {

        $user_record = Tuser::where('user_id', $request->user_id)->where('valid_flag', 1)->first();
        // ユーザーアカウントの有効・無効
        if ( empty($user_record) ) {
                return redirect()->back()->with('flash_message', 'ユーザー名、またはパスワードが間違っています。');
        }

        if( $request->login_password == $user_record->login_password ){
            // 認証失敗許諾回数をリセット　 　最初に取得した初期値で上書き更新
            if( $user_record->allow_login_counts != 5 ){

                Tuser::where('user_id', $request->user_id)->where('valid_flag', 1)->update(['allow_login_counts' => 5]);
---
select * from `t_users` where `user_id` = 'd1hs99999' and `valid_flag` = 1 limit 1